// ------------------------------------------------------------------------------------------------ //
// @ file	 : WinMain.cpp                                                                          //
// @ brief	 : ウインドウを描画するためのエントリーポイント                                         //
// @ date	 : 2017/10/30                                                                           //
// @ author  : Madoka Nakajima                                                                      //
// @ note	 :                                                                                      //
// ------------------------------------------------------------------------------------------------ // 

/* 多重インクルードの防止 */
/* ヘッダファイルのインクルード */
/* 定数の定義 */
/* 変数の定義 */
/* 列挙体の定義 */
/* 構造体の定義 */
/* 関数のプロトタイプ宣言 */
/* 名前空間の宣言 */
/* クラスの宣言 */
/* メンバ変数 */
/* メンバ関数 */
/* メンバ関数の定義 */
/* 関数の定義 */
